export const items = [
  {
    question: 'В чем преимущества профессионалов?',
    id: 0,
    answer: `Опыт, мастерство, высокое качество оборудования и индивидуальный подход к каждому
    клиенту.`
  },
  {
    question: 'Как выбрать подходящего специалиста?',
    id: 1,
    answer: `Исследуйте портфолио и отзывы предыдущих клиентов. Важно, чтобы
    их стиль соответствовал вашим предпочтениям. С важными событиями,
    такими как свадьба, важно также провести встречу,
    чтобы обсудить детали и узнать друг о друге.`
  },
  {
    question: 'Что включает типичный пакет услуг?',
    id: 2,
    answer: `Съемка, обработка, предоставление готовых материалов и, возможно, дополнительные
    услуги по желанию клиента.`
  },
  {
    question: 'Разница между фотографом и видеооператором',
    id: 3,
    answer: `Фотограф делает статичные снимки, а видеооператор снимает движущиеся изображения.`
  },
  {
    question: 'Могу ли я говорить о своих идеях и пожеланиях?',
    id: 4,
    answer: `Конечно! Ваши идеи и пожелания помогут создать идеальный результат.`
  },
  {
    question: 'Как долго занимает обработка и монтаж?',
    id: 5,
    answer: `В зависимости от объема работы, это может занять от нескольких дней до нескольких
    недель.`
  },
  {
    question: 'Могу ли я получить исходный файлы после съемки?',
    id: 6,
    answer: `Обычно да, но уточните это заранее с вашим специалистом.`
  },
  {
    question: 'Что делать, есть мне не понравился результат?',
    id: 7,
    answer: `Обсудите свои замечания со специалистом, чтобы найти решение и улучшить результат.
    Сообщить нам и мы придем на помощь.`
  }
];
